// mock_data.dart
const String mockApiResponse = '''
{
  "result": {
    "limit": 20,
    "offset": 0,
    "count": 1367,
    "sort": "",
    "results": [
      {
        "_id": 1,
        "_importdate": {
          "date": "2024-08-19 10:47:13.538860",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "蘭雅公園地下停車場",
        "公廁地址": "臺北市士林區德行東路129巷31號地下",
        "經度": "121.529402",
        "緯度": "25.109725",
        "管理單位": "蘭雅公園地下停車場",
        "座數": "3",
        "特優級": "0",
        "優等級": "3",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "1",
        "親子廁座數": "0"
      },
      {
        "_id": 2,
        "_importdate": {
          "date": "2024-08-19 10:47:13.546698",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "捷運劍潭站(淡水信義線)",
        "公廁地址": "臺北市士林區中山北路五段65號",
        "經度": "121.525078",
        "緯度": "25.084873",
        "管理單位": "捷運劍潭站(夜)",
        "座數": "5",
        "特優級": "5",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "0",
        "親子廁座數": "1"
      },
      {
        "_id": 3,
        "_importdate": {
          "date": "2024-08-19 10:47:13.547858",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "捷運士林站(淡水信義線)",
        "公廁地址": "臺北市士林區福德路1號",
        "經度": "121.52623",
        "緯度": "25.093535",
        "管理單位": "捷運士林站",
        "座數": "5",
        "特優級": "5",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "0",
        "親子廁座數": "1"
      },
      {
        "_id": 4,
        "_importdate": {
          "date": "2024-08-19 10:47:13.549075",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "捷運芝山站(淡水信義線)",
        "公廁地址": "臺北市士林區福國路70號",
        "經度": "121.522514",
        "緯度": "25.10306",
        "管理單位": "捷運芝山站",
        "座數": "5",
        "特優級": "5",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "0",
        "親子廁座數": "1"
      },
      {
        "_id": 5,
        "_importdate": {
          "date": "2024-08-19 10:47:13.550314",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "百齡高中地下停車場",
        "公廁地址": "臺北市士林區承德路四段175號地下一、二樓",
        "經度": "121.523996",
        "緯度": "25.086151",
        "管理單位": "臺北市停車管理工程處百齡高中地下停車場",
        "座數": "4",
        "特優級": "3",
        "優等級": "1",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "0",
        "親子廁座數": "1"
      },
      {
        "_id": 6,
        "_importdate": {
          "date": "2024-08-19 10:47:13.551431",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "前港公園地下停車場",
        "公廁地址": "臺北市士林區前港街45號地下",
        "經度": "121.520326",
        "緯度": "25.084906",
        "管理單位": "臺北市停車管理工程處前港公園地下停車場",
        "座數": "3",
        "特優級": "0",
        "優等級": "3",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "1",
        "親子廁座數": "0"
      },
      {
        "_id": 7,
        "_importdate": {
          "date": "2024-08-19 10:47:13.552868",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "社園立體停車場",
        "公廁地址": "臺北市士林區延平北路六段180號",
        "經度": "121.505951",
        "緯度": "25.089582",
        "管理單位": "臺北市停車管理工程處社園立體停車場",
        "座數": "2",
        "特優級": "0",
        "優等級": "2",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "0",
        "親子廁座數": "0"
      },
      {
        "_id": 8,
        "_importdate": {
          "date": "2024-08-19 10:47:13.554475",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "故宮廣場停車場",
        "公廁地址": "臺北市士林區至善路二段150號",
        "經度": "121.549242",
        "緯度": "25.099239",
        "管理單位": "臺北市政府停車管理處",
        "座數": "2",
        "特優級": "0",
        "優等級": "0",
        "普通級": "2",
        "改善級": "0",
        "無障礙廁座數": "0",
        "親子廁座數": "0"
      },
      {
        "_id": 9,
        "_importdate": {
          "date": "2024-08-19 10:47:13.555502",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "天母停車場",
        "公廁地址": "臺北市士林區天母西路1號地下1樓",
        "經度": "121.529646",
        "緯度": "25.119953",
        "管理單位": "東和停車場開發股份有限公司天母停車場",
        "座數": "2",
        "特優級": "0",
        "優等級": "2",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "0",
        "親子廁座數": "0"
      },
      {
        "_id": 10,
        "_importdate": {
          "date": "2024-08-19 10:47:13.556685",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "海光公園地下停車場",
        "公廁地址": "臺北市士林區葫蘆街83號",
        "經度": "121.508328",
        "緯度": "25.081436",
        "管理單位": "臺北市停車管理工程處海光公園地下停車場",
        "座數": "3",
        "特優級": "3",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "1",
        "親子廁座數": "0"
      },
      {
        "_id": 11,
        "_importdate": {
          "date": "2024-08-19 10:47:13.557869",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "社子國小地下停車場",
        "公廁地址": "臺北市士林區延平北路六段308號B1",
        "經度": "121.502685",
        "緯度": "25.09",
        "管理單位": "臺北市停車管理工程處社子國小地下停車場",
        "座數": "3",
        "特優級": "3",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "1",
        "親子廁座數": "0"
      },
      {
        "_id": 12,
        "_importdate": {
          "date": "2024-08-19 10:47:13.560443",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "承德公園地下停車場",
        "公廁地址": "臺北市士林區基河路150號",
        "經度": "121.522448",
        "緯度": "25.089893",
        "管理單位": "臺北市停車管理工程處承德公園地下停車場",
        "座數": "3",
        "特優級": "3",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "1",
        "親子廁座數": "0"
      },
      {
        "_id": 13,
        "_importdate": {
          "date": "2024-08-19 10:47:13.561901",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "文昌國小地下停車場",
        "公廁地址": "臺北市士林區文林路615巷20號",
        "經度": "121.521336",
        "緯度": "25.099402",
        "管理單位": "臺北市停車管理工程處文昌國小地下停車場",
        "座數": "2",
        "特優級": "0",
        "優等級": "2",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "0",
        "親子廁座數": "0"
      },
      {
        "_id": 14,
        "_importdate": {
          "date": "2024-08-19 10:47:13.563087",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "交通",
        "公廁名稱": "福林公園地下停車場",
        "公廁地址": "臺北市士林區中正路17號地下",
        "經度": "121.53",
        "緯度": "25.0958",
        "管理單位": "福林公園地下停車場",
        "座數": "3",
        "特優級": "0",
        "優等級": "3",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "1",
        "親子廁座數": "0"
      },
      {
        "_id": 15,
        "_importdate": {
          "date": "2024-08-19 10:47:13.564225",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "文化育樂場所",
        "公廁名稱": "國立臺灣科學教育館",
        "公廁地址": "臺北市士林區士商路189號",
        "經度": "121.51601",
        "緯度": "25.095988",
        "管理單位": "國立臺灣科學教育館",
        "座數": "51",
        "特優級": "51",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "9",
        "親子廁座數": "7"
      },
      {
        "_id": 16,
        "_importdate": {
          "date": "2024-08-19 10:47:13.565401",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "文化育樂場所",
        "公廁名稱": "臺北市立天文科學教育館",
        "公廁地址": "臺北市士林區基河路363號",
        "經度": "121.518965",
        "緯度": "25.096063",
        "管理單位": "臺北市立天文科學教育館",
        "座數": "37",
        "特優級": "37",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "11",
        "親子廁座數": "0"
      },
      {
        "_id": 17,
        "_importdate": {
          "date": "2024-08-19 10:47:13.566601",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "觀光遊憩",
        "公廁名稱": "圓山保齡球館",
        "公廁地址": "臺北市士林區中山北路五段6號",
        "經度": "121.525626",
        "緯度": "25.082348",
        "管理單位": "圓山保齡球館",
        "座數": "4",
        "特優級": "0",
        "優等級": "4",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "0",
        "親子廁座數": "0"
      },
      {
        "_id": 18,
        "_importdate": {
          "date": "2024-08-19 10:47:13.567760",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "文化育樂場所",
        "公廁名稱": "臺北表演藝術中心",
        "公廁地址": "臺北市士林區劍潭路1號",
        "經度": "121.524211",
        "緯度": "25.085079",
        "管理單位": "臺北表演藝術中心",
        "座數": "24",
        "特優級": "24",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "3",
        "親子廁座數": "0"
      },
      {
        "_id": 19,
        "_importdate": {
          "date": "2024-08-19 10:47:13.568887",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "文化育樂場所",
        "公廁名稱": "士林天母棒球場",
        "公廁地址": "臺北市士林區忠誠路二段77號",
        "經度": "121.534287",
        "緯度": "25.114385",
        "管理單位": "龍來球場股份有限公司",
        "座數": "22",
        "特優級": "22",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "2",
        "親子廁座數": "0"
      },
      {
        "_id": 20,
        "_importdate": {
          "date": "2024-08-19 10:47:13.570028",
          "timezone_type": 3,
          "timezone": "Asia/Taipei"
        },
        "行政區": "士林區",
        "公廁類別": "觀光遊憩",
        "公廁名稱": "國立故宮博物院",
        "公廁地址": "臺北市士林區至善路二段221號",
        "經度": "121.54936",
        "緯度": "25.099688",
        "管理單位": "國立故宮博物院",
        "座數": "13",
        "特優級": "13",
        "優等級": "0",
        "普通級": "0",
        "改善級": "0",
        "無障礙廁座數": "1",
        "親子廁座數": "1"
      }
    ]
  }
}
''';